# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'yq'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'htop'

# Development
brew 'imagemagick'
brew 'mysql'
brew 'redis'
brew 'activemq'
brew 'ack'
brew 'watchman'
brew 'wget'
brew 'tig'
brew 'redis'

# Languages
brew 'java'
brew 'maven'
brew 'go'
brew 'gradle'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'python@3.9'

# Kubernetes
brew 'podman'
brew 'kubectx'
brew 'ansible'
brew 'helm'
brew 'skopeo'
brew 'tektoncd-cli'

# Apps
cask '1password'
cask 'balenaetcher'
cask 'caffeine'
cask 'divvy'
cask 'docker'
cask 'imageoptim'
cask 'iterm2'
cask 'keyclu'
cask 'logitech-g-hub'
cask 'loupedeck'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'pastebot'
cask 'pocket-casts'
cask 'rambox'
cask 'the-unarchiver'
cask 'visual-studio-code'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

